{
  "id": "ad-reset-computer-password",
  "title": "Réinitialiser le mot de passe d'un compte ordinateur",
  "description": "Réinitialise le mot de passe du compte ordinateur dans Active Directory.",
  "category": "🏢 Active Directory & GPO",
  "platform": 0,
  "level": 1,
  "tags": [
    "ad",
    "computer",
    "password",
    "reset"
  ],
  "windowsCommandTemplateId": "ad-reset-computer-password-cmd",
  "windowsCommandTemplate": {
    "id": "ad-reset-computer-password-cmd",
    "platform": 0,
    "name": "Reset-ComputerMachinePassword",
    "commandPattern": "Reset-ComputerMachinePassword -Server {dcName}",
    "parameters": [
      {
        "name": "dcName",
        "label": "Nom du contrôleur de domaine",
        "type": "string",
        "defaultValue": "",
        "required": true,
        "description": "Nom du DC à contacter"
      }
    ]
  },
  "examples": [
    {
      "command": "ss -tulpn",
      "description": "🔥 STANDARD LINUX : Liste tous les ports TCP/UDP en écoute (-tul) avec les processus associés (-p) et sans résolution DNS (-n). La commande de référence pour savoir 'qui écoute sur ce port'.",
      "platform": 1
    },
    {
      "command": "ss -s",
      "description": "Résumé statistique rapide des sockets (Total, TCP, UDP). Utile pour détecter une saturation de sockets ou une attaque DDoS.",
      "platform": 1
    },
    {
      "command": "Set-ADAccountPassword -Identity jdupont -Reset -NewPassword (ConvertTo-SecureString -AsPlainText \"P@ssw0rd123!\" -Force)",
      "description": "Réinitialise le mot de passe de jdupont avec un nouveau mot de passe temporaire. ConvertTo-SecureString convertit le texte clair en SecureString (obligatoire pour les mots de passe). Le paramètre -Force supprime l'avertissement de sécurité. ATTENTION : le mot de passe doit respecter la politique de complexité du domaine.",
      "platform": 0
    },
    {
      "command": "$SecurePassword = Read-Host -AsSecureString -Prompt 'Nouveau mot de passe'; Set-ADAccountPassword -Identity jdupont -Reset -NewPassword $SecurePassword",
      "description": "Méthode sécurisée : demande interactivement le mot de passe sans l'afficher à l'écran. Read-Host -AsSecureString masque la saisie (affiche des astérisques). Cette approche est plus sécurisée car le mot de passe n'apparaît jamais en clair dans l'historique PowerShell ou les logs. Recommandée pour les réinitialisations manuelles.",
      "platform": 0
    },
    {
      "command": "Set-ADAccountPassword -Identity jdupont -Reset -NewPassword (ConvertTo-SecureString 'TempP@ss2024!' -AsPlainText -Force) -PassThru | Set-ADUser -ChangePasswordAtLogon $true",
      "description": "Réinitialise le mot de passe ET force l'utilisateur à le changer à la prochaine connexion. Le switch -PassThru passe l'objet utilisateur au pipeline. Set-ADUser -ChangePasswordAtLogon $true active le flag de changement obligatoire. C'est la méthode recommandée pour les réinitialisations : l'admin définit un mot de passe temporaire, l'utilisateur le change immédiatement.",
      "platform": 0
    },
    {
      "command": "Set-ADAccountPassword -Identity jdupont -OldPassword (ConvertTo-SecureString 'OldP@ss' -AsPlainText -Force) -NewPassword (ConvertTo-SecureString 'NewP@ss123!' -AsPlainText -Force)",
      "description": "Change le mot de passe en connaissant l'ancien (sans droits admin). Utilisez -OldPassword quand l'utilisateur change son propre mot de passe ou quand la politique exige la connaissance de l'ancien. Sans -Reset, cette commande nécessite les droits de l'utilisateur concerné mais pas de droits admin.",
      "platform": 0
    },
    {
      "command": "Set-ADAccountPassword -Identity jdupont -Reset -NewPassword (ConvertTo-SecureString 'P@ssw0rd!' -AsPlainText -Force) -Server DC01.contoso.com",
      "description": "Réinitialise le mot de passe sur un contrôleur de domaine spécifique. Le paramètre -Server force l'exécution sur le DC nommé. Utile dans les environnements multi-sites pour garantir la réplication immédiate ou lors du troubleshooting de problèmes de réplication.",
      "platform": 0
    },
    {
      "command": "Get-ADUser -Filter {PasswordExpired -eq $true} | Select-Object Name,SamAccountName,PasswordExpired,PasswordLastSet",
      "description": "Liste tous les utilisateurs dont le mot de passe a expiré. PasswordExpired indique si le mot de passe est périmé selon la politique du domaine. PasswordLastSet affiche la date du dernier changement. Utile pour identifier les comptes nécessitant une réinitialisation et pour les audits de conformité.",
      "platform": 0
    },
    {
      "command": "Set-ADUser -Identity jdupont -PasswordNeverExpires $true",
      "description": "Configure le compte pour que le mot de passe n'expire jamais. ATTENTION : cette commande viole généralement les politiques de sécurité et ne devrait être utilisée que pour des comptes de service spécifiques. Documentez toujours la raison et obtenez une validation.",
      "platform": 0
    }
  ],
  "notes": "À exécuter sur l'ordinateur concerné. Résout les problèmes de relation de confiance avec le domaine.",
  "links": [
    {
      "title": "Documentation Reset-ComputerMachinePassword",
      "url": "https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.management/reset-computermachinepassword"
    }
  ]
}