{
  "id": "gpo-add-security-filter",
  "title": "Ajouter un filtre de sécurité à une GPO",
  "description": "Ajoute un groupe ou utilisateur au filtrage de sécurité d'une GPO.",
  "category": "🏢 Active Directory & GPO",
  "platform": 0,
  "level": 1,
  "tags": [
    "gpo",
    "security",
    "filtering",
    "permissions"
  ],
  "windowsCommandTemplateId": "gpo-add-security-filter-cmd",
  "windowsCommandTemplate": {
    "id": "gpo-add-security-filter-cmd",
    "platform": 0,
    "name": "Set-GPPermission",
    "commandPattern": "Set-GPPermission -Name \"{gpoName}\" -TargetName \"{targetName}\" -TargetType {targetType} -PermissionLevel GpoApply",
    "parameters": [
      {
        "name": "gpoName",
        "label": "Nom de la GPO",
        "type": "string",
        "defaultValue": "",
        "required": true,
        "description": "Nom de la GPO"
      },
      {
        "name": "targetName",
        "label": "Utilisateur/Groupe",
        "type": "string",
        "defaultValue": "",
        "required": true,
        "description": "Nom de l'utilisateur ou du groupe"
      },
      {
        "name": "targetType",
        "label": "Type de cible",
        "type": "string",
        "defaultValue": "Group",
        "required": true,
        "description": "User, Group, ou Computer"
      }
    ]
  },
  "examples": [
    {
      "command": "Set-GPPermission -Name \"Security-Baseline\" -TargetName \"TargetServer\" -TargetType User -PermissionLevel GpoApply -WhatIf",
      "description": "Simulation de l'action sans exécution réelle (dry-run). Le switch -WhatIf affiche ce qui serait modifié sans appliquer les changements. INDISPENSABLE avant toute action de masse ou modification critique. Retirez -WhatIf après validation pour exécuter.",
      "platform": 0
    },
    {
      "command": "Set-GPPermission -Name \"Security-Baseline\" -TargetName \"TargetServer\" -TargetType User -PermissionLevel GpoApply -Confirm:$false",
      "description": "Exécute l'action sans demander de confirmation interactive. -Confirm:$false supprime les invites de validation. Utile dans les scripts automatisés mais à utiliser avec précaution : aucun filet de sécurité.",
      "platform": 0
    },
    {
      "command": "Set-GPPermission -Name \"Security-Baseline\" -TargetName \"TargetServer\" -TargetType User -PermissionLevel GpoApply -PassThru",
      "description": "Force la commande à retourner l'objet modifié/créé dans le pipeline. Par défaut, les cmdlets Set-/New- ne retournent rien. -PassThru active le retour pour permettre des opérations en chaîne ou des vérifications immédiates.",
      "platform": 0
    },
    {
      "command": "Set-GPPermission -Name \"Security-Baseline\" -TargetName \"TargetServer\" -TargetType User -PermissionLevel GpoApply -Verbose",
      "description": "Affiche des informations détaillées sur l'exécution de la commande. -Verbose active les messages de débogage pour comprendre précisément ce qui se passe. Essentiel pour le troubleshooting et la compréhension des opérations internes.",
      "platform": 0
    }
  ],
  "notes": "Le filtrage de sécurité limite l'application de la GPO aux groupes/utilisateurs spécifiés. Nécessite aussi Read.",
  "links": []
}