{
  "id": "win-privacy-208",
  "title": "Désactiver la caméra écran de verrouillage",
  "description": "Désactive l'accès à la caméra depuis l'écran de verrouillage Windows. Sécurité renforcée.",
  "category": "🧹 Windows Debloat",
  "platform": 0,
  "level": 1,
  "tags": [
    "privacy",
    "confidentialité",
    "rgpd",
    "security",
    "caméra",
    "lockscreen",
    "windows"
  ],
  "windowsCommandTemplateId": "win-privacy-208-cmd",
  "windowsCommandTemplate": {
    "id": "win-privacy-208-cmd",
    "platform": 0,
    "name": "Disable-LockScreenCamera",
    "commandPattern": "New-Item -Path 'HKLM:\\SOFTWARE\\Policies\\Microsoft\\Windows\\Personalization' -Force | Out-Null; Set-ItemProperty -Path 'HKLM:\\SOFTWARE\\Policies\\Microsoft\\Windows\\Personalization' -Name 'NoLockScreenCamera' -Type DWord -Value 1",
    "parameters": []
  },
  "examples": [
    {
      "command": "Set-ItemProperty -Path 'HKLM:\\SOFTWARE\\Policies\\Microsoft\\Windows\\Personalization' -Name 'NoLockScreenCamera' -Value 1",
      "description": "Bloque la caméra sur l'écran de verrouillage",
      "platform": 0
    },
    {
      "command": "New-Item -Path 'HKLM:\\SOFTWARE\\Policies\\Microsoft\\Windows\\Personalization' -Force -WhatIf",
      "description": "Simulation de l'action sans exécution réelle (dry-run). Le switch -WhatIf affiche ce qui serait modifié sans appliquer les changements. INDISPENSABLE avant toute action de masse ou modification critique. Retirez -WhatIf après validation pour exécuter.",
      "platform": 0
    },
    {
      "command": "New-Item -Path 'HKLM:\\SOFTWARE\\Policies\\Microsoft\\Windows\\Personalization' -Force -Confirm:$false",
      "description": "Exécute l'action sans demander de confirmation interactive. -Confirm:$false supprime les invites de validation. Utile dans les scripts automatisés mais à utiliser avec précaution : aucun filet de sécurité.",
      "platform": 0
    },
    {
      "command": "New-Item -Path 'HKLM:\\SOFTWARE\\Policies\\Microsoft\\Windows\\Personalization' -Force -PassThru",
      "description": "Force la commande à retourner l'objet modifié/créé dans le pipeline. Par défaut, les cmdlets Set-/New- ne retournent rien. -PassThru active le retour pour permettre des opérations en chaîne ou des vérifications immédiates.",
      "platform": 0
    },
    {
      "command": "New-Item -Path 'HKLM:\\SOFTWARE\\Policies\\Microsoft\\Windows\\Personalization' -Force -Verbose",
      "description": "Affiche des informations détaillées sur l'exécution de la commande. -Verbose active les messages de débogage pour comprendre précisément ce qui se passe. Essentiel pour le troubleshooting et la compréhension des opérations internes.",
      "platform": 0
    }
  ],
  "notes": "Empêche l'accès à la caméra depuis l'écran de verrouillage. Améliore la sécurité en empêchant la prise de photos sans déverrouillage.",
  "links": []
}