{
  "id": "WIN-PERF-405",
  "title": "Limiter Windows Defender CPU à 25%",
  "description": "Limite l'utilisation CPU de Windows Defender lors des analyses pour éviter les ralentissements.",
  "category": "🧹 Windows Debloat",
  "platform": 0,
  "level": 1,
  "tags": [
    "performance",
    "defender",
    "antivirus",
    "cpu",
    "optimisation",
    "windows"
  ],
  "windowsCommandTemplateId": "win-perf-405-cmd",
  "windowsCommandTemplate": {
    "id": "win-perf-405-cmd",
    "platform": 0,
    "name": "Set-MpPreference",
    "commandPattern": "Set-MpPreference -ScanAvgCPULoadFactor 25; Write-Host \"Windows Defender limité à 25% CPU\" -ForegroundColor Green",
    "parameters": []
  },
  "examples": [
    {
      "command": "Set-MpPreference -ScanAvgCPULoadFactor 25",
      "description": "Limite Defender à 25% CPU",
      "platform": 0
    },
    {
      "command": "Set-MpPreference -ScanAvgCPULoadFactor 10",
      "description": "Limite Defender à 10% CPU (analyses très lentes mais PC fluide)",
      "platform": 0
    },
    {
      "command": "Set-MpPreference -ScanAvgCPULoadFactor 25; Write-Host \"Windows Defender limité à 25% CPU\" -ForegroundColor Green -WhatIf",
      "description": "Simulation de l'action sans exécution réelle (dry-run). Le switch -WhatIf affiche ce qui serait modifié sans appliquer les changements. INDISPENSABLE avant toute action de masse ou modification critique. Retirez -WhatIf après validation pour exécuter.",
      "platform": 0
    },
    {
      "command": "Set-MpPreference -ScanAvgCPULoadFactor 25; Write-Host \"Windows Defender limité à 25% CPU\" -ForegroundColor Green -Confirm:$false",
      "description": "Exécute l'action sans demander de confirmation interactive. -Confirm:$false supprime les invites de validation. Utile dans les scripts automatisés mais à utiliser avec précaution : aucun filet de sécurité.",
      "platform": 0
    },
    {
      "command": "Set-MpPreference -ScanAvgCPULoadFactor 25; Write-Host \"Windows Defender limité à 25% CPU\" -ForegroundColor Green -PassThru",
      "description": "Force la commande à retourner l'objet modifié/créé dans le pipeline. Par défaut, les cmdlets Set-/New- ne retournent rien. -PassThru active le retour pour permettre des opérations en chaîne ou des vérifications immédiates.",
      "platform": 0
    },
    {
      "command": "Set-MpPreference -ScanAvgCPULoadFactor 25; Write-Host \"Windows Defender limité à 25% CPU\" -ForegroundColor Green -Verbose",
      "description": "Affiche des informations détaillées sur l'exécution de la commande. -Verbose active les messages de débogage pour comprendre précisément ce qui se passe. Essentiel pour le troubleshooting et la compréhension des opérations internes.",
      "platform": 0
    }
  ],
  "notes": "Par défaut Defender peut utiliser 50-100% CPU lors des analyses, ralentissant le PC. Limiter à 25% (ou 10-15% pour CPU faibles) améliore la fluidité pendant les scans. Les analyses seront plus longues mais moins intrusives.",
  "links": []
}