{
  "id": "win-privacy-301",
  "title": "Désactiver télémétrie Adobe",
  "description": "Désactive la télémétrie et le reporting d'Adobe Creative Cloud (Photoshop, Illustrator, etc.).",
  "category": "🧹 Windows Debloat",
  "platform": 0,
  "level": 1,
  "tags": [
    "privacy",
    "confidentialité",
    "télémétrie",
    "adobe",
    "third-party",
    "windows"
  ],
  "windowsCommandTemplateId": "win-privacy-301-cmd",
  "windowsCommandTemplate": {
    "id": "win-privacy-301-cmd",
    "platform": 0,
    "name": "Disable-AdobeTelemetry",
    "commandPattern": "New-Item -Path 'HKLM:\\SOFTWARE\\Policies\\Adobe\\Adobe Acrobat\\DC\\FeatureLockDown' -Force | Out-Null; Set-ItemProperty -Path 'HKLM:\\SOFTWARE\\Policies\\Adobe\\Adobe Acrobat\\DC\\FeatureLockDown' -Name 'bUsageMeasurement' -Type DWord -Value 0 -ErrorAction SilentlyContinue; New-Item -Path 'HKLM:\\SOFTWARE\\Adobe\\Adobe Desktop Common\\ADS' -Force | Out-Null; Set-ItemProperty -Path 'HKLM:\\SOFTWARE\\Adobe\\Adobe Desktop Common\\ADS' -Name 'AdobeAnalyticsOptOut' -Type DWord -Value 1 -ErrorAction SilentlyContinue; New-Item -Path 'HKLM:\\SOFTWARE\\Adobe\\SuiteCloud' -Force | Out-Null; Set-ItemProperty -Path 'HKLM:\\SOFTWARE\\Adobe\\SuiteCloud' -Name 'OptOut' -Type DWord -Value 1 -ErrorAction SilentlyContinue; $adobeServices = @('AdobeUpdateService', 'AGMService', 'AGSService', 'AdobeARMservice'); foreach ($service in $adobeServices) { Stop-Service -Name $service -Force -ErrorAction SilentlyContinue; Set-Service -Name $service -StartupType Disabled -ErrorAction SilentlyContinue }",
    "parameters": []
  },
  "examples": [
    {
      "command": "New-Item -Path 'HKLM:\\SOFTWARE\\Policies\\Adobe\\Adobe Acrobat\\DC\\FeatureLockDown' -Force -WhatIf",
      "description": "Simulation de l'action sans exécution réelle (dry-run). Le switch -WhatIf affiche ce qui serait modifié sans appliquer les changements. INDISPENSABLE avant toute action de masse ou modification critique. Retirez -WhatIf après validation pour exécuter.",
      "platform": 0
    },
    {
      "command": "New-Item -Path 'HKLM:\\SOFTWARE\\Policies\\Adobe\\Adobe Acrobat\\DC\\FeatureLockDown' -Force -Confirm:$false",
      "description": "Exécute l'action sans demander de confirmation interactive. -Confirm:$false supprime les invites de validation. Utile dans les scripts automatisés mais à utiliser avec précaution : aucun filet de sécurité.",
      "platform": 0
    },
    {
      "command": "New-Item -Path 'HKLM:\\SOFTWARE\\Policies\\Adobe\\Adobe Acrobat\\DC\\FeatureLockDown' -Force -PassThru",
      "description": "Force la commande à retourner l'objet modifié/créé dans le pipeline. Par défaut, les cmdlets Set-/New- ne retournent rien. -PassThru active le retour pour permettre des opérations en chaîne ou des vérifications immédiates.",
      "platform": 0
    },
    {
      "command": "New-Item -Path 'HKLM:\\SOFTWARE\\Policies\\Adobe\\Adobe Acrobat\\DC\\FeatureLockDown' -Force -Verbose",
      "description": "Affiche des informations détaillées sur l'exécution de la commande. -Verbose active les messages de débogage pour comprendre précisément ce qui se passe. Essentiel pour le troubleshooting et la compréhension des opérations internes.",
      "platform": 0
    }
  ],
  "notes": "Désactive la collecte de données Adobe Creative Cloud, Analytics et services de mise à jour. Bloque les services de télémétrie Adobe. Réduit l'utilisation de ressources système.",
  "links": []
}