{
  "id": "win-privacy-103",
  "title": "Désactiver sync des thèmes",
  "description": "Désactive la synchronisation des thèmes, fonds d'écran et personnalisation Windows.",
  "category": "🧹 Windows Debloat",
  "platform": 0,
  "level": 1,
  "tags": [
    "privacy",
    "confidentialité",
    "rgpd",
    "sync",
    "themes",
    "personalization",
    "windows"
  ],
  "windowsCommandTemplateId": "win-privacy-103-cmd",
  "windowsCommandTemplate": {
    "id": "win-privacy-103-cmd",
    "platform": 0,
    "name": "Disable-ThemesSync",
    "commandPattern": "New-Item -Path 'HKCU:\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\SettingSync\\Groups\\Personalization' -Force | Out-Null; Set-ItemProperty -Path 'HKCU:\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\SettingSync\\Groups\\Personalization' -Name 'Enabled' -Type DWord -Value 0",
    "parameters": []
  },
  "examples": [
    {
      "command": "Set-ItemProperty -Path 'HKCU:\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\SettingSync\\Groups\\Personalization' -Name 'Enabled' -Value 0",
      "description": "Désactive la sync des thèmes",
      "platform": 0
    },
    {
      "command": "New-Item -Path 'HKCU:\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\SettingSync\\Groups\\Personalization' -Force -WhatIf",
      "description": "Simulation de l'action sans exécution réelle (dry-run). Le switch -WhatIf affiche ce qui serait modifié sans appliquer les changements. INDISPENSABLE avant toute action de masse ou modification critique. Retirez -WhatIf après validation pour exécuter.",
      "platform": 0
    },
    {
      "command": "New-Item -Path 'HKCU:\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\SettingSync\\Groups\\Personalization' -Force -Confirm:$false",
      "description": "Exécute l'action sans demander de confirmation interactive. -Confirm:$false supprime les invites de validation. Utile dans les scripts automatisés mais à utiliser avec précaution : aucun filet de sécurité.",
      "platform": 0
    },
    {
      "command": "New-Item -Path 'HKCU:\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\SettingSync\\Groups\\Personalization' -Force -PassThru",
      "description": "Force la commande à retourner l'objet modifié/créé dans le pipeline. Par défaut, les cmdlets Set-/New- ne retournent rien. -PassThru active le retour pour permettre des opérations en chaîne ou des vérifications immédiates.",
      "platform": 0
    },
    {
      "command": "New-Item -Path 'HKCU:\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\SettingSync\\Groups\\Personalization' -Force -Verbose",
      "description": "Affiche des informations détaillées sur l'exécution de la commande. -Verbose active les messages de débogage pour comprendre précisément ce qui se passe. Essentiel pour le troubleshooting et la compréhension des opérations internes.",
      "platform": 0
    }
  ],
  "notes": "Empêche la synchronisation des thèmes et de la personnalisation. Les fonds d'écran personnels ne seront pas envoyés au cloud.",
  "links": []
}