Repository: VBlackJack/TwinShell
Catalog: src/TwinShell.Core/Resources/Strings.*.resx
Languages: fr

# Common.Ready
source: Ready
fr: Prêt

# Common.Loading
source: Loading...
fr: Chargement...

# Common.Error
source: Error
fr: Erreur

# Common.Success
source: Success
fr: Succès

# Common.Warning
source: Warning
fr: Attention

# Validation.ParameterRequired
source: The parameter '{0}' is required.
fr: Le paramètre '{0}' est requis.

# Validation.ParameterMustBeInteger
source: The parameter '{0}' must be an integer.
fr: Le paramètre '{0}' doit être un nombre entier.

# Validation.ParameterMustBeBoolean
source: The parameter '{0}' must be true or false.
fr: Le paramètre '{0}' doit être vrai ou faux.

source: Validation Errors:
fr: Erreurs de validation :

# Validation.NoCommandTemplate
source: No command template available.
fr: Aucun modèle de commande disponible.

# Validation.NoValidCommand
source: No valid command to execute
fr: Aucune commande valide à exécuter

source: Execution Error
fr: Erreur d'Exécution

# Execution.Success
source: Execution Successful
fr: Exécution Réussie

source: Execution Cancelled
fr: Exécution Annulée

source: Execution Timeout
fr: Délai d'Exécution Dépassé

# Execution.Failed
source: Failed to execute command: {0}
fr: Échec de l'exécution de la commande : {0}

# Execution.CommandCompleted
source: Command completed in {0:F2} seconds
fr: Commande terminée en {0:F2} secondes

# Favorites.Added
source: Added '{0}' to favorites
fr: '{0}' ajouté aux favoris

# Favorites.Removed
source: Removed '{0}' from favorites
fr: '{0}' retiré des favoris

source: Favorites Limit Reached
fr: Limite de Favoris Atteinte

# Favorites.LimitReachedMessage
source: You have reached the maximum limit of {0} favorites ({1}/{0}). Please remove some favorites before adding new ones.
fr: Vous avez atteint la limite maximale de {0} favoris ({1}/{0}). Veuillez supprimer certains favoris avant d'en ajouter de nouveaux.

# Favorites.ToggleFailed
source: Failed to toggle favorite status
fr: Échec du changement du statut de favori

# Favorites.UpdateError
source: An error occurred while updating favorites
fr: Une erreur s'est produite lors de la mise à jour des favoris

# Config.ExportSuccess
source: Export Successful
fr: Export Réussi

# Config.ExportSuccessMessage
source: Configuration exported successfully to: {0}
fr: Configuration exportée avec succès vers : {0}

# Config.ExportError
source: Export Error
fr: Erreur d'Export

# Config.ExportErrorMessage
source: Export failed: {0}
fr: Échec de l'export : {0}

# Config.ExportErrorGeneric
source: An error occurred during export
fr: Une erreur s'est produite pendant l'export

# Config.ImportSuccess
source: Import Successful
fr: Import Réussi

# Config.ImportSuccessMessage
source: Configuration imported successfully! Favorites imported: {0} History entries imported: {1}
fr: Configuration importée avec succès ! Favoris importés : {0} Entrées d'historique importées : {1}

# Config.ImportError
source: Import Error
fr: Erreur d'Import

# Config.ImportErrorMessage
source: Import failed: {0}
fr: Échec de l'import : {0}

# Config.ImportErrorGeneric
source: An error occurred during import
fr: Une erreur s'est produite pendant l'import

# Config.ValidationError
source: Validation Error
fr: Erreur de Validation

# Config.ValidationErrorMessage
source: Invalid configuration file: {0}
fr: Fichier de configuration invalide : {0}

# Config.ImportConfirmation
source: Confirm Import
fr: Confirmer l'Import

# Config.ImportConfirmationMessage
source: This will import favorites and history from the selected file. Existing data will be preserved (merge mode). Configuration Version: {0} Do you want to continue?
fr: Ceci importera les favoris et l'historique depuis le fichier sélectionné. Les données existantes seront préservées (mode fusion). Version de Configuration : {0} Voulez-vous continuer ?

# Help.Title
source: Help
fr: Aide

# Help.Content
source: TwinShell - Help Keyboard Shortcuts: Ctrl+, - Open Settings Ctrl+M - Manage Categories Ctrl+E - Export Configuration Ctrl+I - Import Configuration F1 - Show this Help F5 - Refresh Actions Esc - Clear Search For more information, visit the documentation.
fr: TwinShell - Aide Raccourcis Clavier : Ctrl+, - Ouvrir Paramètres Ctrl+M - Gérer Catégories Ctrl+E - Exporter Configuration Ctrl+I - Importer Configuration F1 - Afficher cette Aide F5 - Actualiser Actions Échap - Effacer Recherche Pour plus d'informations, consultez la documentation.

# Status.ActionsLoaded
source: {0} actions loaded
fr: {0} actions chargées

# Status.LoadingActions
source: Loading actions...
fr: Chargement des actions...

# Status.Refreshing
source: Refreshing...
fr: Actualisation...

# Status.ProcessingRequest
source: An error occurred while processing your request
fr: Une erreur s'est produite lors du traitement de votre demande
